{
    "displays": [
        {
            "name": "PG_PCB",
            "title": "Automotive PCB",
            "mainImage": "PG_PCB_MAIN.jpeg",
            "color": "#FFD700",
            "orientation": "image--left",
            "toolList":["LTSpice","C++","Fusion 360","Solid Edge"],
            "showDescription": true,
            "description": "During my tenure as a Product Developer at Plasmagear, I spearheaded the conception, testing, and production of two innovative air purifiers for public transport. Joining the team, I encountered minimal progress on the design front, prompting me to single-handedly engineer the entire system from scratch. This involved crafting the case and developing controller boards for both devices. Overcoming the challenge of ensuring functionality in harsh Canadian automotive environments, I assumed the role of lead developer, with the guidance of Chris Batory, and successfully delivered two automotive-grade controller PCBs capable of withstanding extreme temperatures.",
            "showSubDisplay": true,
            "subDisplays": [
                {
                    "image": "PG_PCB--PSU.webp",
                    "title": "PSU Prototype",
                    "description": "This is a prototype switching PSU I built for the controller board. It was used for thermal tests and as a proof of concept. I built many iterations of this design before I approved it."
                },
                {
                    "image": "PG_PCB--THERMAL.webp",
                    "title": "PSU Thermal Imaging",
                    "description": "This is the thermal imaging of the PSU board to ensure it meets the device's operating requirements. It was captured on a small FLIR camera."
                },
                {
                    "image": "PG_PCB--LAYOUT.webp",
                    "title": "PCB Layout",
                    "description": "This is the layout in Autodesk Fusion 360. I was responsible for generating all the schematics, tracings, and subsequent gerber files for production."
                },
                {
                    "image": "PG_PCB--ASPCB.webp",
                    "title": "AirShade PCB",
                    "description": "This second board I designed was a scaled-down version for a similar product called AirShade that required less demanding control subsystems."
                }
            ]
        },
        {
            "name": "RTL",
            "title": "RTL Logic Circuits",
            "mainImage": "RTL_MAIN.jpg",
            "color": "#2DB3EC",
            "orientation": "image--right",
            "toolList":["LTSpice","MicroCap"],
            "showDescription": true,
            "description": "I am fascinated by retro electronics.  During my second co-op, I deeply explored RTL (Resistor-Transistor Logic) and its integration into modern architecture frameworks. This research led me to design custom logic circuits, starting with a specialized board for transistor characterization. I captured and graphed their behaviors to understand the relationship between base and collector currents, crucial for analyzing transistor gain dynamics. Using this knowledge, I built essential logic gates right down to individual component level, including the NOT and NAND gates, and advanced to designing RS and D-type flip-flops. These projects enhanced my skills in RTL design and broadened my grasp of computer architecture fundamentals.",
            "showSubDisplay": true,
            "subDisplays": [
                {
                    "image": "RTL_TRANSISTOR.webp",
                    "title": "Transistor Characterization",
                    "description": "This is a custom characterization board. It allowed me to vary the base current and graph how the base-emitter voltage drop and collector-emitter current respond."
                },
                {
                    "image": "RTL_NAND.webp",
                    "title": "NAND GATE",
                    "description": "NAND gates are the fundamental logic component in all modern-day computer architecture. The one shown here was built using RTL by me."
                },
                {
                    "image": "RTL_RS_FLIPFLOP.webp",
                    "title": "RS Flip Flop",
                    "description": "Like the one here, an RS flip-flop circuit is used to store a single bit. It has a simple operation, only requiring a SET and RESET pin."
                },
                {
                    "image": "RTL_D_FLIPFLOP.webp",
                    "title": "D Type Flip Flop",
                    "description": "This D-type flip-flop is a digital circuit element that stores and outputs a single bit of information customarily based on the state of its input signal at a specific clock edge."
                }
            ]
        },
        {
            "name": "PG_WEBSITE",
            "title": "Corporate Website Dev",
            "mainImage": "PG_WEBSITE_MAIN.png",
            "color": "#FF6E6E",
            "orientation": "image--right",
            "toolList":["HTML","CSS","JavaScript","TailwindCSS"],
            "showDescription": true,
            "description": "At Plasmagear, I spearheaded the development of a corporate website designed to showcase the company's research and development services. Leveraging my expertise in vanilla HTML, CSS, and JavaScript, I crafted a user-friendly and maintainable platform, specifically engineered to facilitate seamless transitions for future developers. This website not only attracted numerous clients but also set a new standard for professionalism, surpassing the capabilities of typical no-code websites. Check it out at www.Plasmagear.ca!",
            "showSubDisplay": false,
            "subDisplays": [
            ]
        },
        {
            "name": "ADDER",
            "title": "analog adder circuit",
            "mainImage": "ADDER_MAIN.jpg",
            "color": "#DC6CF8",
            "orientation": "image--left",
            "toolList":["LTSpice","Fusion 360","MicroCap"],
            "showDescription": true,
            "description": "Continuing my research in RTL logic, I developed an 8-bit binary calculator using individual transistors within the RTL framework. My initial step involved creating a full adder on a perf board as a proof of concept to test the fundamental components. Leveraging Fusion 360, I then designed and produced PCBs, incorporating a custom controller circuit tailored to enhance functionality. Currently, I am in the process of completely redesigning the full adder circuit to implement it with Surface-Mount Technology (SMT) components, which promises improved efficiency and a more compact design. This project not only deepened my expertise in circuit design but also equipped me with practical skills in modern manufacturing technologies.",
            "showSubDisplay": true,
            "subDisplays": [
                {
                    "image": "ADDER_BOARD1.webp",
                    "title": "Initial Prototype",
                    "description": "This is the first prototype of the full adder circuit. It was built on a perf board and used to test the circuit and allowed me to decide on components"
                },
                {
                    "image": "ADDER_BOARD2.webp",
                    "title": "First PCB Layout",
                    "description": "This is a photo of the PCB layout for the full adder circuit. It was designed in Autodesk Fusion 360 and later produced for testing."
                },
                {
                    "image": "ADDER_CONTROL_BOARD.webp",
                    "title": "Controller Board",
                    "description": "The adder required a central controller board to provide input. this is my design for that board. it was later produced and tested."
                },
                {
                    "image": "ADDER_BOARD3.webp",
                    "title": "Second PCB Layout",
                    "description": "This is the most recent run of boards with modifications to the tracings and components. it has recently passed testing."
                }
            ]
        },
        {
            "name": "PG_MECH",
            "title": "Mechanical Design and CAD",
            "mainImage": "PG_MECH_MAIN.webp",
            "color": "#305DD0",
            "orientation": "image--right",
            "toolList":["Fusion 360","SolidWorks"],
            "showDescription": true,
            "description": "During my time at Plasmagear, I was solely responsible for PCB development and the creation of mechanical forms. This encompassed meticulously constructing CAD models from scratch using Autodesk Fusion 360. Additionally, I led the design process for membrane switch panels and the plastic forms, ensuring their functionality and manufacturability through injection molding techniques. Rigorous testing procedures, including crash tests, smoke tests, and particulate filtration tests, were conducted to guarantee the quality and durability of the components. ",
            "showSubDisplay": true,
            "subDisplays": [
                {
                    "image": "PG_MECH_AC_CAD.webp",
                    "title": "AirClenz CAD Model",
                    "description": "This is a photo of the AirClenz mechanical case in Fusion 360; this iteration used a time of flight distance measurement tool for activation. This was eventually replaced with a panel interface."
                },
                {
                    "image": "PG_MECH_AS_CAD.webp",
                    "title": "AirShade CAD Model",
                    "description": "This is a photo of the AirShade mechanical case in Fusion 360 I designed this and it was later used as a reference for manufacturing the final prototypes."
                },
                {
                    "image": "PG_MECH_AC.webp",
                    "title": "AirClenz Prototype",
                    "description": "This is the final AirClenz prototype mounted inside a demo bus for testing and configuration purposes. It was used to test the device's functionality and durability."
                },
                {
                    "image": "PG_MECH_AS.webp",
                    "title": "AirShade Prototype",
                    "description": "This is the final AirShade prototype mounted inside a demo bus for testing and configuration purposes. It offered the team insights into future design changes and improvements."
                }
            ]
        },
        {
            "name": "SPOTR",
            "title": "Spot-R Monitoring System",
            "mainImage": "SPOTR_MAIN.gif",
            "color": "#00CED1",
            "orientation": "image--left",
            "toolList":["Fusion 360","C","C++","Python","LTSpice"],
            "showDescription": true,
            "description": "In 2022, I co-founded Spot-R to address the challenge students face in finding study areas. We developed a non-invasive, centralized system that provides real-time occupancy data using passive infrared (PIR) sensors. We performed rigorous testing with various sensors and even programming Zilog PIR microcontrollers using their IDE software. Our infrastructure was then able to upload this information to an AWS server via the ESP8266 platform. This solution aimed to empower students to optimize their study space usage. However, we found problems with the PIR approach which made the project not viable.",
            "showSubDisplay": true,
            "subDisplays": [
                {
                    "image": "SPOTR_PY.webp",
                    "title": "Data Collection Script",
                    "description": "This is a Python script I wrote to analyze serial data from the Zilog development board on device activation. It allowed me to set limits on activation tolerances and graph our results. "
                },
                {
                    "image": "SPOTR_PROTOTYPE.webp",
                    "title": "Prototype Device",
                    "description": "This is a 3D-printed prototype I designed for the wall-mounted variant. It serves as a proof of concept and allows us to gauge sensor activation in a mounted state. "
                },
                {
                    "image": "SPOTR_ESP.webp",
                    "title": "ESP 8266 Chip",
                    "description": "I wrote a script allowing us to transmit activation data from the PIR sensor over Wi-Fi to an AWS server, where users could query it. This involved some reasonably advanced C++ architecture. "
                },
                {
                    "image": "SPOTR_RESULTS.webp",
                    "title": "PIR Results",
                    "description": "We performed hundreds of tests using various PIR sensors to find one capable of surveying a large study area. This ultimately led us to decide that any low-cost option would not be viable. "
                }
            ]
        },
        {
            "name": "PROJ",
            "title": "Other Personal Projects",
            "mainImage": "PROJ_MAIN.webp",
            "color": "#CAE755",
            "orientation": "image--right",
            "toolList":["Fusion 360","Java"],
            "showDescription": false,
            "description": "",
            "showSubDisplay": true,
            "subDisplays": [
                {
                    "image": "PROJ_GUILLOTINE.webp",
                    "title": "Full Scale Guillotine",
                    "description": "This is a 14-ft full-sized guillotine I built as part of a high school project. The blade was made of half inch of steel and weighed over 30 lbs. I have a wealth of knowledge in wood and metalworking."
                },
                {
                    "image": "PROJ_3D_PRINT.webp",
                    "title": "FDM Experience",
                    "description": "This is a 3D-printed adapter for an FLIR imager. I have owned and operated 3D printers for over six years and have experience with low-end and high-end FDM machines."
                },
                {
                    "image": "PROJ_JAVA.webp",
                    "title": "Java Sorting Algorithm",
                    "description": "I wrote these Insertion, Bubble, and Bogo sort algorithm using JavaScript as a demo for students I was tutoring at the time. Although I have some experience with Java, it is not my preferred language."
                },
                {
                    "image": "PROJ_EROR.webp",
                    "title": "Public Speaking",
                    "description": "A team of students and I were invited to speak at the Young Founders Summit Asia about some research we were doing involving semiconductors. It was a great experience, and I enjoyed speaking on stage."
                }
            ]
        }
    ]
}
