{
    "displays": [
        {
            "name": "CSYS",
            "title": "Lunar Rover - Micro Dosimeter (UDOS)",
            "mainImage": "CSYS_MAIN.jpg",
            "color": "#DC6CF8",
            "orientation": "image--right",
            "toolList":["LTSpice","Altium"],
            "showDescription": true,
            "description": "Served as the sole Project Engineer for the Micro Dosimeter (UDOS) on the Canadian Lunar Rover Mission, part of Canada's contribution to the Artemis Program. Led the design and development of this critical device, taking it from initial schematics to a fully tested prototype in just four months. The Micro Dosimeter, designed to measure radiation events on the lunar surface, is scheduled to launch alongside the rover in 2027.",
            "showSubDisplay": true,
            "subDisplays": [
                {
                    "image": "CSYS--BARE_UDOS.webp",
                    "title": "UDOS Boards",
                    "description": "This photo showcases the micro dosimeter boards that constitute the device stack. Each board was meticulously assembled by me to ensure precision and functionality."
                },
                {
                    "image": "CSYS--ASSY_UDOS.webp",
                    "title": "Assembled UDOS",
                    "description": "The image features the fully assembled prototype of the device, which was utilized in testing to validate performance and reliability under extreme environmental conditions for future iterations."
                },
                {
                    "image": "CSYS--ROVER.webp",
                    "title": "Lunar Rover",
                    "description": "The Canadian Lunar Rover, currently under development by Canadensys, has garnered significant attention and has been featured in numerous news outlets."
                },
                {
                    "image": "CSYS--ARTEMIS.webp",
                    "title": "Artemis",
                    "description": "The Canadian Lunar Rover Mission is a vital component of Canada's contribution to the Artemis Program, serving as a crucial step toward exploring and identifying habitable environments on the lunar surface."
                }
            ]
        },
        {
            "name": "VOX",
            "title": "Voxelis AI",
            "mainImage": "VOX_DEVICE_SIDE.webp",
            "color": "#CAE755",
            "orientation": "image--left",
            "toolList":["Altium","C++", "C", "Python", "LTSpice", "3D CAD"],
            "showDescription": false,
            "description": "",
            "showSubDisplay": true,
            "subDisplays": [
                {
                    "image": "VOX_AS350.webp",
                    "title": "Helicopter Mounting",
                    "description": "VoxVision is currently undergoing flight testing on both the AS350 and the UH-60 Black Hawk."
                },
                {
                    "image": "VOX_LIGHTS.webp",
                    "title": "Rigid-Flex PCBA",
                    "description": "During my time at Voxelis, I designed half a dozen PCBs, but my favorite was the rigid-flex LED driver featured prominently at the front of the device."
                },
                {
                    "image": "VOX_VIBE.webp",
                    "title": "PCBA Design",
                    "description": "I updated and laid out the onboard vibration board, which integrates multiple sensors to monitor a wide range of frequency bands."
                },
                {
                    "image": "VOX_THERM.webp",
                    "title": "Thermal Testing",
                    "description": "I was responsible for designing the in-house thermal chamber, which involved sheet metal design, wireless data acquisition, and control systems integration."
                }
            ]
        },
        {
            "name": "FPGA",
            "title": "FPGA Flight Computer",
            "mainImage": "FPGA_MAIN.webp",
            "color": "#2db3ec",
            "orientation": "image--right",
            "toolList":["Altium","C++", "C", "Python", "LTSpice", "3D CAD"],
            "showDescription": true,
            "description": "Designed a custom PCB flight computer around the Xilinx Zynq-7000 SoC (484-pin BGA) to process frames from five parallel low-cost thermal cameras directly in the FPGA fabric. Implemented dual DDR3 ICs in a fly-by topology, gigabit Ethernet, and complete power-plane separation between processor and motor domains using optically isolated control signals. Designed for reliable high-speed operation by applying controlled impedance stack-up design, length-matched routing, and strict return-path management, enabling real-time thermal hotspot detection and servo actuation.",
            "showSubDisplay": false,
            "subDisplays": []
        },
        {
            "name": "SAT",
            "title": "Pico Satellite",
            "mainImage": "SAT_MAIN.jpg",
            "color": "#FF6E6E",
            "orientation": "image--left",
            "toolList":["LTSpice","Altium", "C++", "Fusion 360"],
            "showDescription": true,
            "description": "I designed and built a pico-satellite, a miniaturized version of the standard CubeSat with a quarter of the volume of a 1U CubeSat. Weighing just 80 grams, this solar-powered satellite features an aluminum chassis and 12 solar cells for efficient energy harvesting. It communicates via a short-burst L-band transceiver and includes two custom-designed main boards: the onboard computer (OBC) and the power conditioning board. The satellite is equipped with specialized sensors to monitor UV-A, UV-B, and UV-C bands, delivering critical data on solar activity. This compact and innovative design showcases advanced functionality in a highly efficient form factor.",
            "showSubDisplay": true,
            "subDisplays": [
                {
                    "image": "SAT--PSU.webp",
                    "title": "PSU Board",
                    "description": "The image depicts the power conditioning board, which efficiently manages power from the solar cells or a 400mAh LiPo battery. It converts the input into stable 3.3V and 5V outputs for the satellite's systems."
                },
                {
                    "image": "SAT--MECH.webp",
                    "title": "Chassis",
                    "description": "The image showcases the satellite's lightweight 6061 aluminum chassis, designed to minimize launch costs. It is electrically isolated from the system's ground to prevent spacecraft charging and ensure operational reliability."
                },
                {
                    "image": "SAT--9603.webp",
                    "title": "RockBlock 9603",
                    "description": "The satellite incorporates a pre-built RockBLOCK 9603 short-burst L-band transceiver with an integrated patch antenna. This choice streamlined the design process and reduced overall system complexity."
                },
                {
                    "image": "SAT--SENSOR.webp",
                    "title": "OSRAM Senosr",
                    "description": "The mission aims to monitor UV radiation using the AMS-OSRAM AS7331 sensor, which performs basic spectral analysis across the 260nm to 360nm wavelength range. The sensor communicates via I2C, transmitting data to the onboard computer (OBC) for analysis."
                }
            ]
        },
        {
            "name": "PG_PCB",
            "title": "Automotive PCB",
            "mainImage": "PG_PCB_MAIN.jpeg",
            "color": "#FFD700",
            "orientation": "image--right",
            "toolList":["LTSpice","C++","Fusion 360","Solid Edge"],
            "showDescription": true,
            "description": "During my tenure as a Product Developer at Plasmagear, I spearheaded the conception, testing, and production of two innovative air purifiers for public transport. Joining the team, I encountered minimal progress on the design front, prompting me to single-handedly engineer the entire system from scratch. This involved crafting the case and developing controller boards for both devices. Overcoming the challenge of ensuring functionality in harsh Canadian automotive environments, I assumed the role of lead developer, with the guidance of Chris Batory, and successfully delivered two automotive-grade controller PCBs capable of withstanding extreme temperatures.",
            "showSubDisplay": true,
            "subDisplays": [
                {
                    "image": "PG_PCB--PSU.webp",
                    "title": "PSU Prototype",
                    "description": "This is a prototype switching PSU I built for the controller board. It was used for thermal tests and as a proof of concept. I built many iterations of this design before I approved it."
                },
                {
                    "image": "PG_PCB--THERMAL.webp",
                    "title": "PSU Thermal Imaging",
                    "description": "This is the thermal imaging of the PSU board to ensure it meets the device's operating requirements. It was captured on a small FLIR camera."
                },
                {
                    "image": "PG_PCB--LAYOUT.webp",
                    "title": "PCB Layout",
                    "description": "This is the layout in Autodesk Fusion 360. I was responsible for generating all the schematics, tracings, and subsequent gerber files for production."
                },
                {
                    "image": "PG_PCB--ASPCB.webp",
                    "title": "AirShade PCB",
                    "description": "This second board I designed was a scaled-down version for a similar product called AirShade that required less demanding control subsystems."
                }
            ]
        },
        {
            "name": "ADDER",
            "title": "analog adder circuit",
            "mainImage": "ADDER_MAIN.jpg",
            "color": "#DC6CF8",
            "orientation": "image--left",
            "toolList":["LTSpice","Fusion 360","MicroCap"],
            "showDescription": true,
            "description": "Continuing my research in RTL logic, I developed an 8-bit binary calculator using individual transistors within the RTL framework. My initial step involved creating a full adder on a perf board as a proof of concept to test the fundamental components. Leveraging Fusion 360, I then designed and produced PCBs, incorporating a custom controller circuit tailored to enhance functionality. Currently, I am in the process of completely redesigning the full adder circuit to implement it with Surface-Mount Technology (SMT) components, which promises improved efficiency and a more compact design. This project not only deepened my expertise in circuit design but also equipped me with practical skills in modern manufacturing technologies.",
            "showSubDisplay": true,
            "subDisplays": [
                {
                    "image": "ADDER_BOARD1.webp",
                    "title": "Initial Prototype",
                    "description": "This is the first prototype of the full adder circuit. It was built on a perf board and used to test the circuit and allowed me to decide on components"
                },
                {
                    "image": "ADDER_BOARD2.webp",
                    "title": "First PCB Layout",
                    "description": "This is a photo of the PCB layout for the full adder circuit. It was designed in Autodesk Fusion 360 and later produced for testing."
                },
                {
                    "image": "ADDER_CONTROL_BOARD.webp",
                    "title": "Controller Board",
                    "description": "The adder required a central controller board to provide input. this is my design for that board. it was later produced and tested."
                },
                {
                    "image": "ADDER_BOARD3.webp",
                    "title": "Second PCB Layout",
                    "description": "This is the most recent run of boards with modifications to the tracings and components. it has recently passed testing."
                }
            ]
        },
        {
            "name": "PG_MECH",
            "title": "Mechanical Design",
            "mainImage": "PG_MECH_MAIN.webp",
            "color": "#305DD0",
            "orientation": "image--right",
            "toolList":["Fusion 360","Solid Edge"],
            "showDescription": true,
            "description": "During my time at Plasmagear, I was solely responsible for PCB development and the creation of mechanical forms. This encompassed meticulously constructing CAD models from scratch using Autodesk Fusion 360. Additionally, I led the design process for membrane switch panels and the plastic forms, ensuring their functionality and manufacturability through injection molding techniques. Rigorous testing procedures, including crash tests, smoke tests, and particulate filtration tests, were conducted to guarantee the quality and durability of the components. ",
            "showSubDisplay": true,
            "subDisplays": [
                {
                    "image": "PG_MECH_AC_CAD.webp",
                    "title": "AirClenz CAD Model",
                    "description": "This is a photo of the AirClenz mechanical case in Fusion 360; this iteration used a time of flight distance measurement tool for activation. This was eventually replaced with a panel interface."
                },
                {
                    "image": "PG_MECH_AS_CAD.webp",
                    "title": "AirShade CAD Model",
                    "description": "This is a photo of the AirShade mechanical case in Fusion 360 I designed this and it was later used as a reference for manufacturing the final prototypes."
                },
                {
                    "image": "PG_MECH_AC.webp",
                    "title": "AirClenz Prototype",
                    "description": "This is the final AirClenz prototype mounted inside a demo bus for testing and configuration purposes. It was used to test the device's functionality and durability."
                },
                {
                    "image": "PG_MECH_AS.webp",
                    "title": "AirShade Prototype",
                    "description": "This is the final AirShade prototype mounted inside a demo bus for testing and configuration purposes. It offered the team insights into future design changes and improvements."
                }
            ]
        }
    ]
}
